tiborsimon/embedded-tdd-headers/pic/8bit/pic12f510_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F510_H_
#define _PIC12F510_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define PA0                           11
#define CWUF                          12
#define GPWUF                         13
#define FSR                           14
#define OSCCAL                        15
#define CAL0                          16
#define CAL                           17
#define CAL1                          18
#define CAL2                          19
#define CAL3                          20
#define CAL4                          21
#define CAL5                          22
#define CAL6                          23
#define GPIO                          24
#define GP                            25
#define GP0                           26
#define GP1                           27
#define GP2                           28
#define GP3                           29
#define GP4                           30
#define GP5                           31
#define CM1CON0                       32
#define nC1WU                         33
#define C1PREF                        34
#define C1NREF                        35
#define C1ON                          36
#define nC1T0CS                       37
#define C1POL                         38
#define nC1OUTEN                      39
#define C1OUT                         40
#define ADCON0                        41
#define ADON                          42
#define nDONE                         43
#define GO_nDONE                      44
#define GO                            45
#define CHS                           46
#define CHS0                          47
#define CHS1                          48
#define ADCS0                         49
#define ADCS                          50
#define ADCS1                         51
#define ANS0                          52
#define ANS                           53
#define ANS1                          54
#define ADRES                         55

#endif // _PIC12F510_H_
